
## Plan Result (prod)

[CI link](https://github.com/goda6565/portfolio/actions/runs/15153080022)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access
* Replace
  * module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "cloudrun_service" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2025-05-20T12:35:30.491671Z"
              - message              = <<-EOT
                    Revision 'frontend-main-00001-v98' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=portfolio-460206&resource=cloud_run_revision/service_name/frontend-main/revision_name/frontend-main-00001-v98&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22frontend-main%22%0Aresource.labels.revision_name%3D%22frontend-main-00001-v98%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2025-05-20T12:35:30.487694Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=portfolio-460206&resource=cloud_run_revision/service_name/frontend-main/revision_name/frontend-main-00001-v98&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22frontend-main%22%0Aresource.labels.revision_name%3D%22frontend-main-00001-v98%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
                # (4 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2025-05-20T12:30:10.141237Z" -> (known after apply)
      ~ creator                 = "terraform-executor@portfolio-460206.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"CNLrscEGEIi2rEM/cHJvamVjdHMvcG9ydGZvbGlvLTQ2MDIwNi9sb2NhdGlvbnMvYXNpYS1ub3J0aGVhc3QxL3NlcnZpY2VzL2Zyb250ZW5kLW1haW4\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/portfolio-460206/locations/asia-northeast1/services/frontend-main" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "terraform-executor@portfolio-460206.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/portfolio-460206/locations/asia-northeast1/services/frontend-main/revisions/frontend-main-00001-v98" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "frontend-main"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2025-05-20T12:35:30.491671Z"
              - message              = <<-EOT
                    Revision 'frontend-main-00001-v98' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=portfolio-460206&resource=cloud_run_revision/service_name/frontend-main/revision_name/frontend-main-00001-v98&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22frontend-main%22%0Aresource.labels.revision_name%3D%22frontend-main-00001-v98%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "e4e2b670-4dc1-4be0-8018-cb9dd66e4b3f" -> (known after apply)
      ~ update_time             = "2025-05-20T12:30:10.141237Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://frontend-main-186242794041.asia-northeast1.run.app",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          ~ service_account                  = "186242794041-compute@developer.gserviceaccount.com" -> (known after apply)
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              - depends_on     = [] -> null
                name           = null
                # (3 unchanged attributes hidden)

              ~ ports {
                  ~ container_port = 8080 -> 80
                  ~ name           = "http1" -> (known after apply)
                }

              ~ resources (known after apply)
              - resources {
                  - cpu_idle          = true -> null
                  - limits            = {
                      - "cpu"    = "1000m"
                      - "memory" = "512Mi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

              ~ startup_probe (known after apply)
              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }
            }

          ~ scaling {
              ~ max_instance_count = 40 -> 1
                # (1 unchanged attribute hidden)
            }
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "frontend-main"
      + project  = "portfolio-460206"
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




## :warning: Errors

* add a label prod/destroy: POST https://api.github.com/repos/goda6565/portfolio/issues/31/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":31,"Program":"tfcmt","SHA1":"1df47874e75cc4e14934f2bb70d2f623d07111be","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->